export enum BankCode {
  KDB = '002', // 산업
  IBK = '003', // 기업
  KB = '004', // KB국민
  SOOHYUP = '007', // 수협
  NONGHYUP = '011', // 농협
  WOORI = '020', // 우리
  SC = '023', // SC제일
  CITY = '027', // 씨티
  DAEGOO = '031', // 대구
  BUSAN = '032', // 부산
  GWANGJU = '034', // 광주
  JEJU = '035', // 제주
  JEONBOOK = '037', // 전북
  KYUNGNAM = '039', // 경남
  MG = '045', // 새마을금고
  SHINHYUP = '048', // 신협
  NFCF = '064',
  EPOST071 = '071', // 우체국
  EPOST079 = '079', // 우체국
  HANA = '081', // 하나
  SHINHAN = '088', // 신한
  K_BANK = '089', // K뱅크
  KAKAO_BANK = '090' // 카카오뱅크는 법인에서만 가능
}

export const BankCodeObj = {
  '002' : '산업은행', 
  '003' : '기업은행', 
  '004' : 'KB국민은행', 
  '007' : '수협은행', 
  '011' : '농협은행', 
  '020' : '우리은행', 
  '023' : 'SC제일은행', 
  '027' : '씨티은행', 
  '031' : '대구은행', 
  '032' : '부산은행', 
  '034' : '광주은행', 
  '035' : '제주은행', 
  '037' : '전북은행', 
  '039' : '경남은행', 
  '045' : '새마을금고', 
  '048' : '신협', 
  '064' : 'NFCF',
  '071' : '우체국', 
  '079' : '우체국', 
  '081' : '하나은행', 
  '088' : '신한은행', 
  '089' : 'K뱅크', 
  '090' : '카카오뱅크'
}
